In [1]:
import pandas as pd

In [2]:
v=pd.Series((1,2,3),index=[1,2,3],dtype=float)
v

1    1.0
2    2.0
3    3.0
dtype: float64

In [3]:
dataFrame={
    'name':['kanhu','amar','lucky'],
    'age':[25,32,27]
}
var=pd.DataFrame(dataFrame,index=[1,2,3])
var['age<30']=var['age']<=30
var

    name  age  age<30
1  kanhu   25    True
2   amar   32   False
3  lucky   27    True

In [4]:
var.insert(3,'loc',['od',"gu",'cu'])
var

    name  age  age<30 loc
1  kanhu   25    True  od
2   amar   32   False  gu
3  lucky   27    True  cu

In [5]:
var.insert(4,'mob',var['age'])
var
var.insert(2,'add_age',var['age']+var['mob'])
var

    name  age  add_age  age<30 loc  mob
1  kanhu   25       50    True  od   25
2   amar   32       64   False  gu   32
3  lucky   27       54    True  cu   27

In [6]:
var1=var.pop('mob')

In [7]:
var
var1

1    25
2    32
3    27
Name: mob, dtype: int64

In [8]:
del var['loc']
var

    name  age  add_age  age<30
1  kanhu   25       50    True
2   amar   32       64   False
3  lucky   27       54    True

In [9]:
var.to_csv('pratice.csv')

In [17]:
a=pd.read_csv('D:\\PyThOn\\pandas\\frinds.csv')
a

     name   age    city
0   kanhu  25.0  Odisha
1    anil  24.0  odisha
2  soumya   NaN  Odisha

In [19]:
a.dropna(axis=1)
a

     name   age    city
0   kanhu  25.0  Odisha
1    anil  24.0  odisha
2  soumya   NaN  Odisha

In [21]:
a.fillna(method='ffill')
a

     name   age    city
0   kanhu  25.0  Odisha
1    anil  24.0  odisha
2  soumya   NaN  Odisha